# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import random

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [6]:
baby = pd.read_csv("baby.csv")
baby.head()
baby.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

### Step 4. See the first 10 entries

In [7]:
baby.head(1)

   Unnamed: 0     Id  Name  Year Gender State  Count
0       11349  11350  Emma  2004      F    AK     62

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [8]:
baby.drop(columns = ['Unnamed: 0', 'Id'], inplace = True)
baby.head(1)

   Name  Year Gender State  Count
0  Emma  2004      F    AK     62

### Step 6. Is there more male or female names in the dataset?

In [10]:
baby.groupby("Gender").describe()

            Year                                                         \
           count         mean       std     min     25%     50%     75%
Gender
F       558846.0  2009.026258  3.137428  2004.0  2006.0  2009.0  2012.0
M       457549.0  2009.086085  3.139039  2004.0  2006.0  2009.0  2012.0

                   Count
           max     count       mean         std  min  25%   50%   75%     max
Gender
F       2014.0  558846.0  29.310925   75.962992  5.0  6.0  10.0  23.0  3634.0
M       2014.0  457549.0  41.615650  118.074308  5.0  7.0  12.0  29.0  4167.0

### Step 7. Group the dataset by name and assign to names

In [37]:
names = pd.DataFrame(baby.groupby("Name").Count.sum().sort_values(ascending = False))
names.head()

           Count
Name
Jacob     242874
Emma      214852
Michael   214405
Ethan     209277
Isabella  204798

### Step 8. How many different names exist in the dataset?

In [38]:
names.shape

(17632, 1)

### Step 9. What is the name with most occurrences?

In [41]:
names.tail()

            Count
Name
Eniola          5
Atlantis        5
Marci           5
Simarpreet      5
Nita            5

### Step 10. How many different names have the least occurrences?

In [42]:
names.tail()

            Count
Name
Eniola          5
Atlantis        5
Marci           5
Simarpreet      5
Nita            5

### Step 11. What is the median name occurrence?

In [46]:
names[names["Count"] == names.median()[0]]

/var/folders/zn/6npf5pd5277gbjjtr2b6gy400000gn/T/ipykernel_2177/1763823665.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  names[names["Count"] == names.median()[0]]

          Count
Name
Zuleima      49
Vita         49
Aziah        49
Kaedence     49
Antonina     49
...         ...
Mckynzie     49
Yoni         49
Hareem       49
Jkwon        49
Nazier       49

[66 rows x 1 columns]

### Step 12. What is the standard deviation of names?

In [47]:
names.describe()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000

### Step 13. Get a summary with the mean, min, max, std and quartiles.